# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

# n = int(input('Введите количество монет:'))
# a = int(input('Введите количество монет, лежащих вверх решкой:'))
# if n - a >= a:
#     print(f'Необходимо перевернуть {a} монет')
# else:
#     print(f'Необходимо перевернуть {n - a} монет')






# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает
# Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя
# должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих
# чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# s = int(input('Введите сумму искомых чисел: '))
# p = int(input('Введите произведение искомых чисел: '))
#
# # x + y = s   x = s - y
# # x * y = p   x = p / y
# # s - y = p / y
# # sy - y*y - p = 0
# # y*y - sy + p = 0
#
# d = s * s - 4 * p
# import math
# y = (s + math.sqrt(d)) / 2
# x = (s - math.sqrt(d)) / 2
#
# if 1000 >= y > 0 and 1000 >= x > 0 and x % 1 == 0 and y % 1 == 0:
#     print(f'Петя загадал числа {x} и {y}.')
# else:
#     print(f'Введенные значения некорректны.')






# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

# n = int(input('Введите число: '))
# a = 2
# b = 1
# while a <= n:
#     print(f'{b} {a}')
#     a *= 2
#     b += 1